#+STARTIP: overview
#+TITLE: emacs configuration
#+CREATOR: Julien Boulange
#+LANGUAGE: en
#+OPTIONS: num:nil

** Smoother scrolling
#+BEGIN_SRC emacs-lisp
  (setq scroll-conservatively 100)
#+END_SRC

#+RESULTS:
: 100

**** Company
#+BEGIN_SRC emacs-lisp
  ;;(defun company-ess-setup ()
  ;;   (setq-local company-backends
  ;;               (append '(company-dabbrev) company-backends)))
  ;;(with-eval-after-load 'company
  ;;  (add-hook ess-mode-hook 'company-ess-setup)
  ;;  )


  (defun R-mode-hooks ()
    ;; show help
    (define-key company-active-map (kbd "M-h") 'company-show-doc-buffer)
    ;; start R
  ;;  (split-window-below)
  ;;  (R)
  )
  (add-hook 'R-mode-hook 'R-mode-hooks)

  ;;(add-to-list 'company-dabbrev-code-modes 'ess-mode)
#+END_SRC

#+RESULTS:
| ess-mode | prog-mode | batch-file-mode | csharp-mode | css-mode | erlang-mode | haskell-mode | jde-mode | lua-mode | python-mode |

* Kill-ring 
This give access to a menu displaying the various pasted item by pressing M-y
#+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (require 'spaceline-config)
  (spaceline-emacs-theme)
#+END_SRC

#+RESULTS:
| %e | (:eval (spaceline-ml-main)) |

